local-paths.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-19 Tue 17:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Install packages &amp; libraries on your local paths</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Gnanesh Kunal">
<meta name="description" content="Configure local paths."
>
<meta name="keywords" content="Packages">
<link rel="stylesheet" href="css/stylesheet.css">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Install packages &amp; libraries on your local paths</h1>
</header><p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;May 13, 2018&gt;</span></span>
</p>

<p>
Fedora is my favorite Linux distribution which is sponsored by Red Hat.
Fedora 28 is out with a lot of features. Instead of upgrading my fedora
using <code>dnf-plugin-system-upgrade</code> or the <code>GNOME Software</code> way, I'd
always like to download the ISO and install it from a USB Flash Drive
(cause that returns a pointer to the ISO and I could use it anywhere
(ಠ⌣ಠ)). 
</p>

<p>
I have a love/hate relationship is with the Red Hat's
<code>Automatic Partition</code> which usually leaves with just 50GB for the
<code>Computer</code> (<code>/</code>) and the rest for your <code>$HOME</code>. So I usually do
<code>Manual Partition</code> and give the partitions the right space. But
<code>Automatic Partitions</code> will save you some time by automatically giving
other partitions the right amount of space.
</p>

<p>
This time, I opted for <code>Automatic Partition</code> and now I'm left with just
52.6GB. Actually its just 42.7GB after doing <code>dnf upgrade</code>. In my past,
the first time when I've given Fedora a try, I used it for more days
than I thought I would and I was struggling with &lt;12GB of free space.
That was the time, I thought, I wish I had known how to configure and
install libraries on my local paths without letting everything existing
packages down(<code>pkg-config</code>).
</p>

<p>
Now, I've finally found a way to install libraries on my own path. I
like to use <code>$HOME/.local/</code>.
</p>

<div id="outline-container-orgce45689" class="outline-2">
<h2 id="the-usual-way"><a id="orgce45689"></a>The Usual way</h2>
<div class="outline-text-2" id="text-the-usual-way">
<p>
Usually, When you compile libraries from source, the usual way would be
</p>

<div class="org-src-container">
<pre class="src src-sh">./configure
make
sudo make install
</pre>
</div>

<p>
or
</p>

<div class="org-src-container">
<pre class="src src-sh">./autogen.sh
./configure
make
sudo make install
</pre>
</div>

<p>
Where do you think the libraries get installed?
</p>

<p>
That's <code>/usr/local/include</code> for headers, <code>/usr/local/lib/</code> for your
libraries that you can link with your programs. And also, <code>pkg-config</code>
easily finds your libraries and packages.
</p>

<p>
What if you have less space on your <code>Computer</code> or like to install a
package in a different location (like as I said <code>$HOME/.local/</code>)?
</p>
</div>
</div>

<div id="outline-container-orgecb59d1" class="outline-2">
<h2 id="what-you-need-to-do"><a id="orgecb59d1"></a>What You Need To Do</h2>
<div class="outline-text-2" id="text-what-you-need-to-do">
<p>
Well, that's easy though. The <code>configure</code> script also has a <code>--prefix</code>
argument that allows you to install the package on given path.
</p>

<div class="org-src-container">
<pre class="src src-sh">./configure --prefix $<span style="color: #BA36A5;">HOME</span>/.local
make
make install
</pre>
</div>

<p>
<b>Note that you don't need the sudo command</b>, as
the <code>$HOME</code> doesn't require you to have <code>root</code> privileges.
</p>

<p>
After installing
</p>

<div class="org-src-container">
<pre class="src src-sh">[monster@monster json-c]$ whereis json-c
json-c: /home/monster/.local/include/json-c
</pre>
</div>

<p>
But will your packages be found and linked to other programs that use
this packages?
</p>

<p>
<b>Now I could finally install packages on my local paths.</b> (YAY) 
<b>Will I be able to use it? The answer is NO.</b> (BOOO)
</p>

<p>
You must add the path to your <code>$PATH</code> variable.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">~.bashrc</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">PATH</span>=<span style="color: #008000;">"$PATH:$HOME/.local/lib:$HOME/.local/share:$HOME/.local/include:$HOME/.local/bin"</span>
</pre>
</div>

<p>
Sometimes you get complains about shared libraries.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">~/.bashrc</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">LD_LIBRARY_PATH</span>=<span style="color: #008000;">"$LD_LIBRARY_PATH:$HOME/.local/lib"</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">LIBRARY_PATH</span>=<span style="color: #008000;">"$LIBRARY_PATH:$HOME/.local/lib"</span>
</pre>
</div>

<p>
Also, you love <code>pkg-config</code>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">~/.bashrc</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">PKG_CONFIG_PATH</span>=<span style="color: #008000;">"$PKG_CONFIG_PATH:$HOME/.local/lib/pkgconfig"</span>
</pre>
</div>

<p>
When you manually compile, your <code>C/C++</code> compiler complains that it
couldn't find the headers.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">~/.bashrc</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">CPATH</span>=<span style="color: #008000;">"$CPATH:$HOME/.local/include"</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">C_INCLUDE_PATH</span>=<span style="color: #008000;">"$C_INCLUDE_PATH:$HOME/.local/include"</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">CPLUS_INCLUDE_PATH</span>=<span style="color: #008000;">"$CPLUS_INCLUDE_PATH:$HOME/.local/include"</span>
</pre>
</div>
</div>

<div id="outline-container-org1eaf612" class="outline-4">
<h4 id="useful-links"><a id="org1eaf612"></a>Useful Links</h4>
<div class="outline-text-4" id="text-useful-links">
<ul class="org-ul">
<li><a href="http://www.network-theory.co.uk/docs/gccintro/gccintro_23.html">GCC Environemnt Variables</a></li>
<li><a href="https://askubuntu.com/questions/210210/pkg-config-path-environment-variable">pkg-config path Environment Variables</a></li>
<li><a href="https://stackoverflow.com/questions/480764/linux-error-while-loading-shared-libraries-cannot-open-shared-object-file-no-s">Shared Libraries paths'</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<hr></hr>
<div class="nav">
<ul>
<li><a href="index.html">Home</a></li>
<li><a href="about.html">About</a></li>
<li><a href="https://github.com/Gnaneshkunal">GitHub</a></li>
<li><a href="resume.pdf">Resume</a></li>
</ul>
</div>
</div>
</body>
</html>
